app/controllers/products_controller.rb

INSERT INTO "products" ("content", "created_at", "pic", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", nil], ["created_at", Tue, 22 Jan 2013 07:54:25 UTC +00:00], ["pic", nil], ["title", nil], ["updated_at", Tue, 22 Jan 2013 07:54:25 UTC +00:00]]
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save